In [5]:
import pandas as pd

# To main datatypes

In [6]:
# 1. series
series = pd.Series(["BMW", "Toyota", "Honda"])

In [7]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [8]:
# series= 1-dimensional

In [9]:
 colours = pd.Series(["red","blue","white"])

In [10]:
colours

0      red
1     blue
2    white
dtype: object

In [11]:
# 2. Dataframe = 2- dimensional

In [12]:
car_data = pd.DataFrame({"car make":series,"colour":colours})

In [13]:
car_data

  car make colour
0      BMW    red
1   Toyota   blue
2    Honda  white

In [14]:
# Import data

In [15]:
car_sales = pd.read_csv("car-sales.csv")

In [16]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [17]:
# Exporting a dataframe 
car_sales.to_csv("exported-car-sales.csv")

In [18]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [19]:
# Exporting a dataframe 
car_sales.to_csv("exported-car-sales.csv", index = False )

In [20]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describe data

In [21]:
# Attribute
car_sales.dtypes

# Function 
# car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [22]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [23]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [24]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [25]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [26]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [27]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [28]:
car_sales.mean()

TypeError: Could not convert ['ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyotaNissan'
 'WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite'
 '$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'] to numeric

In [ ]:
car_sales.mean(numeric_only= True)

In [ ]:
car_prices = pd.Series([3000,14000,40000])
car_prices.mean()

In [ ]:
car_sales.sum()

In [ ]:
car_sales["Doors"].sum()

In [ ]:
len(car_sales)

# Viewing and Selecting data

In [ ]:
# returns the top 5 rows of the dataframe 
car_sales.head()

In [ ]:
car_sales

In [ ]:
# gives described number of rows 
car_sales.head(7)

In [ ]:
# this returns the bottom 5 rows 
car_sales.tail()

In [ ]:
# . loc & .iloc
animals = pd.Series(["cat","dog","panda"])
animals

In [ ]:
animals = pd.Series(["cat","dog","panda"],index=[0,3,9])
animals

In [ ]:
# loc refers to index number (location)
animals.loc[3]

In [ ]:
car_sales

In [ ]:
car_sales.loc[3]

In [ ]:
# .iloc - this refers to position
# loc - this refers to index
animals.iloc[2]

In [ ]:
car_sales.iloc[3]

In [ ]:
animals

In [ ]:
# Slicing 
animals.iloc[:2]

In [ ]:
animals.loc[:2]

In [ ]:
car_sales

In [ ]:
# to print the Make column
car_sales["Make"]

In [ ]:
car_sales.Make

In [ ]:
# for particual filtering- only Toyota rows 
car_sales[car_sales["Make"] == "Toyota"]

In [ ]:
car_sales[car_sales["Odometer (KM)"] > 100000]

In [ ]:
# To compare two columns -crosstab - aggregating columns together 
pd.crosstab(car_sales["Make"],car_sales["Doors"])

In [ ]:
 # Groupby 
 car_sales.groupby(["Make"]).mean(numeric_only= True)

In [ ]:
car_sales["Odometer (KM)"].plot()

In [ ]:
car_sales

In [ ]:
#graph plot
car_sales["Odometer (KM)"].plot()

In [ ]:
#histogram - distribution(spread of data)
car_sales["Odometer (KM)"].hist()

In [ ]:
car_sales["Price"].plot()

In [ ]:
# only numeric data can plot as it is not numeric so you get error 
car_sales["Price"].dtype

In [ ]:
# now converting this price column into a int 
# so here replace that dollar with empty '' nothing AC
car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]','').astype(int)

In [ ]:
car_sales["Price"].plot()

# Manipulating data

In [ ]:
#on columns getting its string value and manipulating it
car_sales["Make"].str.lower()

In [ ]:
# to modify the column values 
car_sales["Make"] = car_sales["Make"].str.lower()

In [ ]:
car_sales

In [ ]:
# inplace parameter 
# sometimes data can have missing data (some data is not filled in some columns 
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")
car_sales_missing

In [ ]:
mean = car_sales_missing["Odometer"].mean()

In [ ]:
# replace those missing Nan with the mean but this isnt actuallly modifying in the below table 
car_sales_missing["Odometer"].fillna(mean)

In [ ]:
car_sales_missing

In [ ]:
# This is because we have to inplace modifying 
car_sales_missing["Odometer"] = car_sales_missing["Odometer"].fillna(mean,inplace=True)

In [ ]:
# you can remove the rows with NaN , this might remove inplace 
car_sales_missing.dropna(inplace=True)

In [ ]:
car_sales_missing

In [ ]:
# so they are removed inplace to get them back you have to import them again
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")

In [ ]:
car_sales_missing

In [ ]:
car_sales_missing_dropped = car_sales_missing.dropna()

In [ ]:
car_sales_missing_dropped

In [ ]:
car_sales_missing

In [ ]:
# addign that dropped data to csv
car_sales_missing_dropped.to_csv("car-sales-missing-dropped.csv")

# Creating data from previous Existing data

In [ ]:
# Column from series 
seats_column = pd.Series([5,5,5,5,5])

# new column called seats
car_sales["Seats"] = seats_column
car_sales

In [ ]:
# fill those seats with 
car_sales["Seats"].fillna(5,inplace=True)

In [ ]:
car_sales

In [ ]:
# column from python list 
fuel_economy = [7.5,9.2,5.0,9.6,8.7,4.5,6.7,8.9,7.9,1.3]
car_sales["Fuel per 10 KM"] = fuel_economy
car_sales

In [ ]:
# creating column from other columns 
car_sales["Total fuel used"] = car_sales["Odometer (KM)"]/100*car_sales["Fuel per 10 KM"]
car_sales

In [ ]:
car_sales["Total fuel used (L)"] = car_sales["Odometer (KM)"]/100*car_sales["Fuel per 10 KM"]
car_sales

In [ ]:
# creating column from single value 
car_sales["Number of wheels"] = 4
car_sales

In [ ]:
car_sales["Passed road test"] = True
car_sales

In [ ]:
car_sales.dtypes

In [ ]:
# Removign column 
car_sales = car_sales.drop("Total fuel used",axis=1)
car_sales

In [ ]:
car_sales

now in machine learning the main part is those validation set, test set and those all 
but first you have to randomize the data

In [ ]:
# shuffling rowss in a data frame 
car_sales.sample(frac=1)

In [ ]:
car_sales

In [29]:
# but to assign the inorder then 
car_sales_shuffled = car_sales.sample(frac=1)
car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
3     BMW  Black          11179      5  $22,000.00
5  Toyota  Green          99213      4   $4,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
1   Honda    Red          87899      4   $5,000.00
9  Nissan  White          31600      4   $9,700.00
2  Toyota   Blue          32549      3   $7,000.00
4  Nissan  White         213095      4   $3,500.00
6   Honda   Blue          45698      4   $7,500.00

In [30]:
car_sales_shuffled.to_csv("car-sales-shuffled")

In [31]:
# only select 20% of data  for experimentation
car_sales_shuffled.sample(frac=0.2)

# only 1% of data - here less number of rows so you dont feel much difference 
car_sales_shuffled.sample(frac=0.01)

Empty DataFrame
Columns: [Make, Colour, Odometer (KM), Doors, Price]
Index: []

In [32]:
# for resetting index
car_sales_shuffled.reset_index()

   index    Make Colour  Odometer (KM)  Doors       Price
0      0  Toyota  White         150043      4   $4,000.00
1      3     BMW  Black          11179      5  $22,000.00
2      5  Toyota  Green          99213      4   $4,500.00
3      7   Honda   Blue          54738      4   $7,000.00
4      8  Toyota  White          60000      4   $6,250.00
5      1   Honda    Red          87899      4   $5,000.00
6      9  Nissan  White          31600      4   $9,700.00
7      2  Toyota   Blue          32549      3   $7,000.00
8      4  Nissan  White         213095      4   $3,500.00
9      6   Honda   Blue          45698      4   $7,500.00

In [34]:
car_sales_shuffled.reset_index(drop=True,inplace = True)

In [35]:
car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1     BMW  Black          11179      5  $22,000.00
2  Toyota  Green          99213      4   $4,500.00
3   Honda   Blue          54738      4   $7,000.00
4  Toyota  White          60000      4   $6,250.00
5   Honda    Red          87899      4   $5,000.00
6  Nissan  White          31600      4   $9,700.00
7  Toyota   Blue          32549      3   $7,000.00
8  Nissan  White         213095      4   $3,500.00
9   Honda   Blue          45698      4   $7,500.00

In [38]:
# applying some function- lambda-anonymous function(1.6 -> kilometers to miles 
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x:x/1.6)

In [37]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White      93776.875      4   $4,000.00
1   Honda    Red      54936.875      4   $5,000.00
2  Toyota   Blue      20343.125      3   $7,000.00
3     BMW  Black       6986.875      5  $22,000.00
4  Nissan  White     133184.375      4   $3,500.00
5  Toyota  Green      62008.125      4   $4,500.00
6   Honda   Blue      28561.250      4   $7,500.00
7   Honda   Blue      34211.250      4   $7,000.00
8  Toyota  White      37500.000      4   $6,250.00
9  Nissan  White      19750.000      4   $9,700.00

# Try it, run your code 
# Search for it 
# Try again 
# Ask

In [39]:
#you can directly import from github path to colab and work directly